spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/creates_a_customer_with_a_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=11&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Ee0kCnCotyjuQ0OnsakoneHS
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tealeaf-rails1-132653 3.13.4 #1 SMP Thu Mar 6 03:42:38 UTC 2014 x86_64 x86_64
        x86_64 GNU/Linux"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 22 Dec 2014 19:27:36 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '624'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_3KTmlK9b3qkUTDJ6
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_15Cbq8BUofbCWxo13UDvdEXX",
          "livemode": false,
          "created": 1419276456,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_15Cbq8BUofbCWxo125IxpMHR",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 11,
            "exp_year": 2016,
            "fingerprint": "kmuttaUoZGSNB9xB",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "dynamic_last4": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Mon, 22 Dec 2014 19:27:36 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_15Cbq8BUofbCWxo13UDvdEXX&plan=base&email=rosemary_hegmann%40altenwerthgerhold.info
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Ee0kCnCotyjuQ0OnsakoneHS
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tealeaf-rails1-132653 3.13.4 #1 SMP Thu Mar 6 03:42:38 UTC 2014 x86_64 x86_64
        x86_64 GNU/Linux"}'
      Content-Length:
      - '91'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 22 Dec 2014 19:27:37 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2331'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_jlFLFDE91Z6mI2ji
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1419276457,
          "id": "cus_5NMZBK22Tj0soA",
          "livemode": false,
          "description": null,
          "email": "rosemary_hegmann@altenwerthgerhold.info",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5NMZBK22Tj0soA/subscriptions",
            "data": [
              {
                "id": "sub_5NMZLxNOiLhKXI",
                "plan": {
                  "interval": "month",
                  "name": "the base plan",
                  "created": 1418672313,
                  "amount": 999,
                  "currency": "usd",
                  "id": "base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_descriptor": "MyFlix monthly",
                  "statement_description": "MyFlix monthly"
                },
                "object": "subscription",
                "start": 1419276457,
                "status": "active",
                "customer": "cus_5NMZBK22Tj0soA",
                "cancel_at_period_end": false,
                "current_period_start": 1419276457,
                "current_period_end": 1421954857,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5NMZBK22Tj0soA/cards",
            "data": [
              {
                "id": "card_15Cbq8BUofbCWxo125IxpMHR",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 11,
                "exp_year": 2016,
                "fingerprint": "kmuttaUoZGSNB9xB",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5NMZBK22Tj0soA"
              }
            ]
          },
          "default_card": "card_15Cbq8BUofbCWxo125IxpMHR"
        }
    http_version: 
  recorded_at: Mon, 22 Dec 2014 19:27:37 GMT
recorded_with: VCR 2.9.3
