spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_valid_card/charges_the_card_succesfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=11&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Ee0kCnCotyjuQ0OnsakoneHS
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tealeaf-rails1-132653 3.13.4 #1 SMP Thu Mar 6 03:42:38 UTC 2014 x86_64 x86_64
        x86_64 GNU/Linux"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 19:53:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '624'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_mVtcxx4oiScWKrGe
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_15A4unBUofbCWxo1R2QU6f1G",
          "livemode": false,
          "created": 1418673237,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_15A4unBUofbCWxo1I1yH6j4V",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 11,
            "exp_year": 2016,
            "fingerprint": "kmuttaUoZGSNB9xB",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "dynamic_last4": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 19:53:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&card=tok_15A4unBUofbCWxo1R2QU6f1G
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Ee0kCnCotyjuQ0OnsakoneHS
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tealeaf-rails1-132653 3.13.4 #1 SMP Thu Mar 6 03:42:38 UTC 2014 x86_64 x86_64
        x86_64 GNU/Linux"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 19:53:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1295'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_F7aRV1JlWGqkyeA7
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A4unBUofbCWxo1dO6VhAa2",
          "object": "charge",
          "created": 1418673237,
          "livemode": false,
          "paid": true,
          "amount": 300,
          "currency": "usd",
          "refunded": false,
          "captured": true,
          "card": {
            "id": "card_15A4unBUofbCWxo1I1yH6j4V",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 11,
            "exp_year": 2016,
            "fingerprint": "kmuttaUoZGSNB9xB",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": null
          },
          "balance_transaction": "txn_15A4unBUofbCWxo1eVOydYpL",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_15A4unBUofbCWxo1dO6VhAa2/refunds",
            "data": []
          }
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 19:53:57 GMT
recorded_with: VCR 2.9.3
